# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# ввод данных
#number = 123
number = int(input('Введите число: '))

# работа с данными
one = int(number / 100)                             # 123 / 100 -> 1,23
two = int(((number / 100) % 1) * 10)                # 123 / 100 -> 1,23 % 1 -> 0,23 * 10 -> 2,3
three = int(((number / 10) % 1) * 10)               # 123 / 10 -> 12,3 % 1 -> 0,3 * 10 -> 3

result = one + two + three                          # сумма элементов

# вывод данных
print(f'{number} -> {result} ({one} + {two} + {three})')
